OpenFOAM/reatorWALE/system/snappyHexMeshDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	snappyHexMeshDict;
}
castellatedMesh	true;
snap	true;
addLayers	true;
geometry
{
	cylinder_1.stl
	{
		type	triSurfaceMesh;
		simflowType	primitive;
		primitiveType	cylinder;
		name	cylinder_1;
		point1	(0.0 0.0 -0.0115);
		point2	(0.0 0.0 0.0115);
		radius	0.023;
		faceGroups
		{
			disk1
			{
				name	cylinder_1_contact1E;
			}
			disk2
			{
				name	cylinder_1_contact1D;
			}
			cylinder
			{
				name	cylinder_1_contact1;
			}
		}
	}
	geo_100_mL_Wheel.stl
	{
		type	triSurfaceMesh;
		simflowType	stl;
		name	geo_100_mL_Wheel;
		includedAngle	120.0;
	}
	Modified_100mL_Vessel.stl
	{
		type	triSurfaceMesh;
		simflowType	stl;
		name	Modified_100mL_Vessel;
		includedAngle	120.0;
		splitAngle	120.0;
		faceGroups
		{
			patch00
			{
				name	Modified_100mL_Vessel;
			}
			patch01
			{
				name	Modified_100mL_Vessel;
			}
			patch02
			{
				name	Modified_100mL_Vessel;
			}
			patch03
			{
				name	Modified_100mL_Vessel;
			}
			patch04
			{
				name	Modified_100mL_Vessel;
			}
			patch05
			{
				name	Modified_100mL_Vessel;
			}
			patch06
			{
				name	Modified_100mL_Vessel;
			}
			patch07
			{
				name	Modified_100mL_Vessel;
			}
			patch08
			{
				name	Modified_100mL_Vessel;
			}
			patch09
			{
				name	Modified_100mL_Vessel;
			}
			patch010
			{
				name	Modified_100mL_Vessel;
			}
		}
	}
}
castellatedMeshControls
{
	locationInMesh	(-0.001 0.039 0.0015);
	refinementSurfaces
	{
		cylinder_1
		{
			level	( 0 1 );
			patchInfo
			{
				type	wall;
			}
			faceZone	cylinder_1;
			faceType	baffle;
			cellZone	cylinder_1;
			cellZoneInside	inside;
		}
		geo_100_mL_Wheel
		{
			level	( 0 1 );
			patchInfo
			{
				type	wall;
			}
		}
		Modified_100mL_Vessel
		{
			level	( 0 1 );
			patchInfo
			{
				type	wall;
			}
		}
	}
	refinementRegions
	{
	}
	limitRegions
	{
	}
	features	
	(
	{
		file	"cylinder_1.eMesh";
		levels	((0 0));
	}
	{
		file	"geo_100_mL_Wheel.eMesh";
		levels	((0 2));
	}
	{
		file	"Modified_100mL_Vessel.eMesh";
		levels	((0 2));
	}
	);
	maxLocalCells	1000000;
	maxGlobalCells	10000000;
	nCellsBetweenLevels	4;
	maxLoadUnbalance	0.1;
	minRefinementCells	10;
	resolveFeatureAngle	30.0;
	allowFreeStandingZoneFaces	true;
}
snapControls
{
	tolerance	1.0;
	nSmoothPatch	3;
	nSolveIter	500;
	nRelaxIter	5;
	nFeatureSnapIter	10;
	implicitFeatureSnap	true;
	explicitFeatureSnap	true;
	multiRegionFeatureSnap	true;
	nFaceSplitInterval	5;
}
addLayersControls
{
	layers
	{
		geo_100_mL_Wheel
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		geo_100_mL_Wheel_patch0
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		Modified_100mL_Vessel_patch00
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		Modified_100mL_Vessel_patch01
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		Modified_100mL_Vessel_patch02
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		Modified_100mL_Vessel_patch03
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		Modified_100mL_Vessel_patch04
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		Modified_100mL_Vessel_patch05
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		Modified_100mL_Vessel_patch06
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		Modified_100mL_Vessel_patch07
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		Modified_100mL_Vessel_patch08
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		Modified_100mL_Vessel_patch09
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
		Modified_100mL_Vessel_patch010
		{
			nSurfaceLayers	3;
			expansionRatio	1.25;
			firstLayerThickness	0.2;
		}
	}
	relativeSizes	true;
	minThickness	0.1;
	firstLayerThickness	0.2;
	expansionRatio	1.25;
	nGrow	0;
	featureAngle	180.0;
	maxFaceThicknessRatio	0.5;
	nSmoothSurfaceNormals	5;
	nSmoothThickness	10;
	minMedialAxisAngle	90.0;
	maxThicknessToMedialRatio	0.5;
	nMedialAxisIter	100;
	nSmoothNormals	3;
	slipFeatureAngle	30.0;
	nRelaxIter	5;
	nBufferCellsNoExtrude	0;
	nLayerIter	50;
	nRelaxedIter	20;
	detectExtrusionIsland	true;
}
meshQualityControls
{
	maxNonOrtho	65.0;
	maxBoundarySkewness	20.0;
	maxInternalSkewness	4.0;
	maxConcave	80.0;
	minVol	1.0E-14;
	minTetQuality	1.0E-20;
	minArea	-1.0;
	minTwist	0.02;
	minTriangleTwist	-1.0;
	minDeterminant	0.01;
	minFaceWeight	0.05;
	minVolRatio	0.01;
	minVolCollapseRatio	0.1;
	nSmoothScale	4;
	errorReduction	0.75;
	relaxed
	{
		maxNonOrtho	75.0;
	}
}
mergeTolerance	1.0E-6;
debug	0;
