OpenFOAM/reatorWALE/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version	2.0;
	class	uniformDimensionedVectorField;
	format	ascii;
	location	"constant";
	object	g;
}
dimensions	[0 1 -2 0 0 0 0];
value	(0.0 -9.81 0.0);
