OpenFOAM/reatorWALE/0/U
FoamFile
{
	version             2.0;
	format              binary;
	arch                "LSB;label=32;scalar=64";
	class               volVectorField;
	location            "0";
	object              U;
}


dimensions	[0 1 -1 0 0 0 0];
internalField	uniform (0.0 0.0 0.0);
boundaryField
{
	top
	{
		type	        partialSlip;
        valueFraction   uniform 0.0;
	}
	geo_100_mL_Wheel
	{
		type	movingWallVelocity;
		value	uniform (0.0 0.0 0.0);
	}
	cylinder_1_contact1
	{
		type	cyclicAMI;
	}
	cylinder_1_contact1_slave
	{
		type	cyclicAMI;
	}
	Modified_100mL_Vessel
	{
		type	noSlip;
	}
}
