OpenFOAM/reatorWALE/0/p
FoamFile
{
	version             2.0;
	format              binary;
	arch                "LSB;label=32;scalar=64";
	class               volScalarField;
	location            "0";
	object              p;
}


dimensions	[0 2 -2 0 0 0 0];
internalField	uniform 0.0;
boundaryField
{
	top
	{
		type	zeroGradient;
	}
	geo_100_mL_Wheel
	{
		type	zeroGradient;
	}
	cylinder_1_contact1
	{
		type	cyclicAMI;
	}
	cylinder_1_contact1_slave
	{
		type	cyclicAMI;
	}
	Modified_100mL_Vessel
	{
		type	zeroGradient;
	}
}
