OpenFOAM/reatorWALE/0/CO2
FoamFile
{
	version             2.0;
	format              binary;
	arch                "LSB;label=32;scalar=64";
	class               volScalarField;
	location            "0";
	object              CO2;
}


dimensions	[0 -3 0 0 1 0 0];
internalField	uniform 0.0;
boundaryField
{
	top
	{
		type	fixedValue;
		value	uniform 0.278;
	}
	geo_100_mL_Wheel
	{
		type	zeroGradient;
	}
	cylinder_1_contact1
	{
		type	cyclicAMI;
	}
	cylinder_1_contact1_slave
	{
		type	cyclicAMI;
	}
	Modified_100mL_Vessel
	{
		type	zeroGradient;
	}
}
