OpenFOAM/reatorWALE/system/fvSchemes
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	fvSchemes;
}
ddtSchemes
{
	default                             backward;
}
gradSchemes
{
	default	                            cellMDLimited Gauss linear 0.5;
}
divSchemes
{
    default                             none;
	div((nuEff*dev2(T(grad(U)))))	    Gauss linear;
	div(R)	                            Gauss limitedLinear;
	div(phi,U)	                        Gauss linearUpwind grad(U);
	div(phi,CO2)                        Gauss limitedCubic01 1;
}
laplacianSchemes
{
	default	                            Gauss linear limited 0.777;
}
interpolationSchemes
{
	default	                            skewCorrected linear;
}
snGradSchemes
{
	default	                            limited 0.777;
}
fluxRequired
{
	default	                            no;
	                                    p	;
}
wallDist
{
	method	                            meshWave;
	nRequired	                        false;
}
