OpenFOAM/reatorWALE/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	fvSolution;
}
solvers
{
	p
	{
		solver	GAMG;
		smoother	GaussSeidel;
		relTol	1.0E-4;
		cacheAgglomeration	true;
		nFinestSweeps	2;
		nPreSweeps	0;
		maxIter	500;
		nPostSweeps	1;
		agglomerator	faceAreaPair;
		nCellsInCoarsestLevel	10;
		tolerance	1.0E-9;
		mergeLevels	1;
	}
	pFinal
	{
		solver	GAMG;
		smoother	GaussSeidel;
		relTol	1.0E-4;
		cacheAgglomeration	true;
		nFinestSweeps	2;
		nPreSweeps	0;
		maxIter	500;
		nPostSweeps	1;
		agglomerator	faceAreaPair;
		nCellsInCoarsestLevel	10;
		tolerance	1.0E-9;
		mergeLevels	1;
		minIter	1;
	}
    "pcorr.*"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        cacheAgglomeration no;

        tolerance        0.02;
        relTol           0;
    }
	U
	{
		solver	PBiCGStab;
		relTol	1.0E-4;
		preconditioner	DILU;
		tolerance	1.0E-8;
		maxIter	100;
	}
	UFinal
	{
		solver	PBiCGStab;
		relTol	1.0E-4;
		preconditioner	DILU;
		tolerance	1.0E-8;
		maxIter	100;
		minIter	1;
	}
	CO2
	{
		solver	PBiCGStab;
		relTol	1.0E-4;
		preconditioner	DILU;
		tolerance	1.0E-8;
		maxIter	100;
	}
	CO2Final
	{
		solver	PBiCGStab;
		relTol	0;
		preconditioner	DILU;
		tolerance	1.0E-8;
		maxIter	100;
		minIter	1;
	}
}
PIMPLE
{
	consistent	true;
	nCorrectors	2;
	nNonOrthogonalCorrectors 2;
	momentumPredictor	true;
	moveMeshOuterCorrectors	 true;
	correctPhi	yes;
	checkMeshCourantNo	false;
	nOuterCorrectors 2;

	pRefCell	0;
	pRefValue	0.0;
}
relaxationFactors
{
	p	1;
	U	1;
    CO2 1;
}
